                              ОСНОВНЫЕ ЗАПРОСЫ К БД

In [ ]:
SELECT DISTINCT (DISTINCT - уникальные значения)
    столбец1 AS новое_название,
    столбец2,
    столбец3
FROM таблица
WHERE (условие1 OR условие2)
    AND условие3
    AND столбец1 LIKE "A%" в названии в начале присутствует А, % - все остальное
    AND year NOT BETWEEN 1965 AND 1980 между
    AND like '____________' означает любоей символ вместо "_"
ORDER BY сортировка1, сортировка2 DESC - обратная сортировка
OFFSET 1 LIMIT 2

                             ОСНОВНЫЕ АГРЕГАТНЫЕ ФУНКЦИИ

In [ ]:
SELECT
    COUNT(*)
FROM sql.pokemon

COUNT — вычисляет число непустых строк;
SUM — вычисляет сумму;
AVG — вычисляет среднее;
MAX — вычисляет максимум;
MIN — вычисляет минимум.
Внутри функции COUNT мы можем также применять DISTINCT, чтобы вычислить количество уникальных значений.
SELECT
    COUNT(DISTINCT type1)
FROM sql.pokemon

                     GROUP BY группировка

In [ ]:
SELECT
    type1 AS pokemon_type,
    COUNT(*) AS pokemon_count
FROM sql.pokemon
GROUP BY pokemon_type
ORDER BY COUNT(*) DESC

                       HAVING Фильтрация уже агрегированных данных. Важно! HAVING обязательно пишется после GROUP BY.

                                 Объединение таблиц по столбцу

In [ ]:
SELECT 
    long_name,
    home_team_goals,
    away_team_goals
FROM
    sql.teams,
    sql.matches
WHERE home_team_api_id = api_id

                            Объединение таблиц через Join

In [ ]:
SELECT 
    long_name,
    home_team_goals,
    away_team_goals
FROM    
    sql.teams
JOIN sql.matches on home_team_api_id = api_id

                             Переименовываем таблицы

In [ ]:
SELECT
    столбец1 новое_название_столбца,
	столбец2 новое_название_столбца,
	...
FROM
	таблица1 короткое_название_1
JOIN таблица2 короткое_название_2 ON условие

SELECT
    m.id match_id,
    t.id team_id
FROM
    sql.matches m
    join sql.teams t on t.api_id = m.home_team_api_id
ORDER BY 1

                                          ОБЪЕДИНЕНИЕ ТАБЛИЦ

In [ ]:
#LEFT:
SELECT
    t.long_name /*столбец long_name таблицы t*/
FROM sql.teams t /*таблица teams с алиасом t*/
LEFT JOIN sql.matches m ON t.api_id = m.home_team_api_id OR t.api_id = m.away_team_api_id /*оператор соединения left JOIN; таблица matches с алиасом m; условие: home_team_api_id таблицы m равен api_id таблицы t или away_team_api_id таблицы m равен api_id таблицы t*/
WHERE
    m.season = '2008/2009'  /*условие: столбец season таблицы m имеет значение 2008/2009*/
AND t.long_name = 'KAS Eupen' /*условие: столбец long_name таблицы t имеет значение KAS Eupen*/

----------------

#FULL OUTER JOIN:
Оператор FULL OUTER JOIN объединяет в себе LEFT и RIGHT JOIN и позволяет сохранить кортежи обеих таблиц. Даже если не будет соответствий, мы сохраним все записи из обеих таблиц.
Пример: в базе данных интернет-магазина есть две таблицы — с зарегистрированными пользователями и пользователями, оформившими заказ. При этом оформить заказ можно без регистрации,
а зарегистрироваться — без оформления заказа.
SELECT 
…
FROM
	table1
FULL OUTER JOIN table2 ON условие

-----------------

#CROSS JOIN:
SELECT *
FROM
    sql.teams,
    sql.matches

!SAME!

SELECT *
FROM
    sql.teams
    CROSS JOIN sql.matches

!SAME!

SELECT *
FROM
    sql.teams
    JOIN sql.matches ON TRUE
    
--------------------------

#NATRUAL JOIN:
Ключевое слово natural в начале оператора JOIN позволяет не указывать условие соединения таблиц — для соединения будут использованы столбцы с одинаковым названием из этих таблиц.

NATURAL JOIN можно использовать с любыми видами соединений, которые требуют условия соединения:

→ NATURAL INNER JOIN (возможна запись NATURAL JOIN);
→ NATURAL LEFT JOIN;
→ NATURAL RIGHT JOIN;
→ NATURAL FULL OUTER JOIN.

При использовании NATURAL JOIN прежде всего стоит обратить внимание на ключи таблиц. Для наших таблиц teams и matches этот вид соединения не подойдёт, 
так как общим для обеих таблиц является столбец id, но таблицы соединяются по другим столбцам.

                                 UNION

In [ ]:
(SELECT book_name object_name, 'книга' object_descritption 
FROM public.books
ORDER BY 1
LIMIT 1)
UNION ALL
(SELECT movie_title, 'фильм' 
FROM sql.kinopoisk
ORDER BY 1
LIMIT 1)

UNION  - ОСТАВЛЯЕТ ТОЛЬКО УНИКАЛЬНЫЕ ЗНАЧЕНИЯ. UNION ALL соединяет все

                         ИЗМЕНЕНИЕ ТИПА ДАННЫХ В СТОЛБЦЕ

SELECT 
         c.city_id::text /*выбираем столбец city_id, переводим city_id из числового в текстовый формат*/
FROM
         sql.city c /*из схемы sql  и таблицы city, задаём таблице алиас с*/

UNION ALL /*оператор присоединения*/

SELECT 
         cc.city_name /*выбираем столбец city_name*/
FROM
         sql.city cc /*из схемы sql и таблицы city, задаём таблице алиас сс*/

              ДОБАВЛЯЕМ обобщённые данные

In [ ]:
SELECT
         c.city_name,
         c.population /*выбираем столбцы city_name, population*/
FROM
         sql.city c /*из схемы sql и таблицы city, задаём таблице алиас с*/

UNION ALL /*оператор присоединения*/

SELECT
         'total',
         SUM(c.population) /*сами задаём объект ‘total’, суммируем все значения столбца population*/
FROM
         sql.city c /*из схемы sql и таблицы city, задаём таблице алиас с*/
ORDER BY 2 DESC /*сортируем по второму столбцу в убывающем порядке (чтобы итоговая сумма была в начале)*/

                                         ЗАМЕНЯ ПО ЗНАЧЕНИЙ ПО УСЛОВИЯ

SELECT
         d.first_name,
         d.last_name,
         'телефон заполнен' phone_info /*выбираем столбцы first_name, last_name, сами выводим объект ‘телефон заполнен’*/
FROM
         sql.driver d /*из схемы sql и таблицы driver, задаём алиас d*/
WHERE d.phone IS NOT NULL /*условие, что телефон заполнен*/

UNION /*оператор присоединения (уникальные значения)*/

SELECT
         d.first_name,
         d.last_name,
         'телефон не заполнен' phone_info /*выбираем столбцы first_name, last_name, сами выводим объект ‘телефон не заполнен’*/
FROM
         sql.driver d /*из схемы sql и таблицы driver, задаём алиас d*/
WHERE d.phone IS NULL /*условие, что телефон не заполнен*/

                             Доабвляем строки сами


SELECT 
         '+' result

UNION 

SELECT 
         '-'

UNION 

SELECT
        '='
UNION 

SELECT
        '/'

                                   ИСКЛЮЧЕНИЯ EXCEPT ( ОБРЕЗАЕМ ОДНУ ТАБЛИЦУ ДРУГОЙ)

In [ ]:
SELECT
         c.city_name /*выбираем столбец city_name*/
FROM
         sql.shipment s /*из схемы sql и таблицы shipment, задаём таблице алиас s*/
JOIN sql.city c ON s.city_id = c.city_id /*внутреннее присоединение из схемы sql таблицы city, задав ей алиас c, по ключам city_id*/

EXCEPT /*оператор присоединения*/

SELECT
         cc.city_name  /*выбираем столбец city_name*/
FROM
         sql.driver d /*из схемы sql и таблицы driver, задаём таблице алиас d*/
JOIN sql.city cc ON d.city_id=cc.city_id /*внутреннее присоединение из схемы sql таблицы city, задав ей алияс cc, по ключам city_id*/
ORDER BY 1 /*сортировка по первому столбцу*/

                                   ПЕРЕСЕКАЮЩИЕСЯ ЗНАЧЕНИЯ

In [ ]:
SELECT 
         c.city_name object_name /*выбираем столбец city_name, задаём ему алиас object_name*/
FROM 
         sql.city c /*из схемы sql и таблицы city, задаём таблице алиас с*/

INTERSECT /*оператор присоединения*/

SELECT 
         cc.state /*выбираем столбец state*/
FROM 
         sql.city cc /*из схемы sql и таблицы city, задаём таблице алиас с*/
ORDER BY 1

                                        ВЫВОДИМ МСК ВРЕМЯ

In [ ]:
select now() at time zone 'Europe/Moscow'

                                  EXRTACT ВЫДЕЛЯЕМ НУЖНОЕ ЗНАЧЕНИЕ ИЗ ДАТЫ

In [ ]:
DAY

Для значений timestamp это день месяца (1-31), для значений interval — число дней.

SELECT EXTRACT(DAY FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 16

SELECT EXTRACT(DAY FROM INTERVAL '40 days 1 minute');
Результат: 40

!
HOUR

Час (0-23).

SELECT EXTRACT(HOUR FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 20

!
MONTH

Номер месяца, считая с января (1) до декабря (12).

SELECT EXTRACT(MONTH FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 2

!
YEAR

Поле года. Учтите, что года 0 не было, и это следует иметь в виду, вычитая из годов нашей эры годы до нашей эры.

SELECT EXTRACT(YEAR FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 2001

!
ISOYEAR

Год по недельному календарю ISO 8601, в который попадает дата (не применимо к интервалам).

SELECT EXTRACT(ISOYEAR FROM DATE '2006-01-01');
Результат: 2005

SELECT EXTRACT(ISOYEAR FROM DATE '2006-01-02');
Результат: 2006

Год по недельному календарю ISO начинается с понедельника недели, в которой оказывается 4 января, так что в начале января или в конце декабря год по ISO может отличаться от года по григорианскому календарю. Подробнее об этом рассказывается в описании поля week.

!
WEEK

Номер недели в году по недельному календарю ISO 8601. По определению, недели ISO 8601 начинаются с понедельника, а первая неделя года включает 4 января этого года. Другими словами, первый четверг года всегда оказывается в первой неделе этого года.

В системе нумерации недель ISO первые числа января могут относиться к 52-й или 53-й неделе предыдущего года, а последние числа декабря — к первой неделе следующего года.

Например, 2005-01-01 относится к 53-й неделе 2004 г., а 2006-01-01 — к 52-й неделе 2005 г., тогда как 2012-12-31 включается в первую неделю 2013 г.

Поэтому для получения согласованных результатов рекомендуется использовать поле isoyear в паре с week.

SELECT EXTRACT(WEEK FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 7

!
CENTURY

SELECT EXTRACT(CENTURY FROM TIMESTAMP '2000-12-16 12:21:13');
Результат: 20

SELECT EXTRACT(CENTURY FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 21

Первый век начался 0001-01-01 00:00:00, хотя люди в то время так и не считали. Это определение распространяется на все страны с григорианским календарём.

Века с номером 0 не было; считается, что 1 наступил после -1.

Если такое положение вещей вас не устраивает, направляйте жалобы по адресу: Ватикан, Собор Святого Петра, Папе Римскому, лично в руки :)

!
DECADE

Десятилетие.

SELECT EXTRACT(DECADE FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 200

!
EPOCH

Для значений timestamp with time zone это число секунд с 1970-01-01 00:00:00 UTC (может быть отрицательным); для значений date и timestamp это число секунд с 1970-01-01 00:00:00 по местному времени, а для interval — общая длительность интервала в секундах.

SELECT EXTRACT(EPOCH FROM TIMESTAMP WITH TIME ZONE
'2001-02-16 20:38:40.12-08');
Результат: 982384720.12

SELECT EXTRACT(EPOCH FROM INTERVAL '5 days 3 hours');
Результат: 442800

Преобразовать время эпохи обратно, в значение дата/время, с помощью to_timestamp можно так:

SELECT to_timestamp(982384720.12);
Результат: 2001-02-17 04:38:40.12+00

!
DOW

День недели, считая с воскресенья (0) до субботы (6).

SELECT EXTRACT(DOW FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 5

Заметьте, что в extract() дни недели нумеруются не так, как в функции to_char(..., 'D').

!
DOY

День года (1-365/366).

SELECT EXTRACT(DOY FROM TIMESTAMP '2001-02-16 20:38:40');
Результат: 47

!
ISODOW

День недели, считая с понедельника (1) до воскресенья (7).

SELECT EXTRACT(ISODOW FROM TIMESTAMP '2001-02-18 20:38:40');
Результат: 7

Результат отличается от dow только для воскресенья. Такая нумерация соответствует ISO 8601.

                                         РАЗНОВИДНОСТИ ДАТЫ И ВРЕМЕНИ

Смотри файл date.png

                                  ВЫВОДИМ ВРЕМЯ С ТЕКСТОМ

select to_char(now() at time zone 'Europe/Moscow','"Точное время "HH24 "часов" MI "минут" SS "секунд"') as msg

                                    ОКРУГЛЯЕМ ДАТУ ПО НУЖНОМУ ЗНАЧЕНИЮ

In [ ]:
Если мы хотим округлить текущее время-дату до минут, то можно вызвать

 select date_trunc('minute',now())

                                     РАБОТА С ТЕКСТОМ

In [ ]:
Конструкции с оператором соединения строк записываются следующим образом(конкатенация):
строка1 || строка2 || ... || строкаN
SELECT 
        'Ваш заказ доставит водитель '||d.first_name||' '||d.last_name||'. '||'Его контактный номер: '||coalesce(d.phone,'-') msg# coalesce(d.phone,'-') выводит если None значение '-'
FROM shipping.driver d

#верхний нижний регистры
select upper('Abc') s1 ,lower('xYz') s2

# замена символов
select replace('малако','а','о')# молоко
select replace('Hello, world!',', world','') # удаляем ", world"

# обрезаем строки
select left('0123456789', - 2), right('0123456789', - 2)# Результат: 01234567 и 23456789
select left('0123456789', 3)# 012

#выводим текст через format:
select format('Hello, %s!', d.first_name) from shipping.driver d # %s - символ подставки перечисленных значений после запятой по порядку

#длинна строки
length(key_skills)